'''
Напишите программу, выводящую слова Hello, world десять раз
'''

print('Hello World\n' * 10)